docs/build/html/_static/frontmatter/catkit.org
#+Title: CatKit
#+Author: Jacob Boes
#+SETUPFILE: ../theme-readtheorg.setup

* Graph-atoms (Gratoms) object
The =Gratoms= object is a child class of the ASE =Atoms= object class. Effectively, this means that it has all the same functionality as an =Atoms= object with some additional features as well.

