docs/build/html/_static/frontmatter/catkit.org
** Graph information
The =Gratoms= object primary function is to conveniently store and manage graph information.

#+BEGIN_SRC python :results output org drawer
from catkit import Gratoms
from catkit.build import molecule
import numpy as np

atoms0 = molecule('C4H10')[0]

print(type(atoms0))
print('\nAtomic numbers')
numbers = atoms0.numbers

print('#+attr_latex: :mode math :environment matrix')
print('|' + '|'.join(numbers.astype(str)))

print('\nConnectivity matrix:'.format())
matrix = atoms0.connectivity
table_matrix = np.array(matrix, dtype=str)

print('#+attr_latex: :mode math :environment matrix')
for row in table_matrix:
    print('|' + '|'.join(row.astype(str)))

atoms1 = atoms0.copy()
del atoms1[0]

print('\nAtomic numbers')
numbers = atoms1.numbers

print('#+attr_latex: :mode math :environment matrix')
print('|' + '|'.join(numbers.astype(str)))

print('\nConnectivity matrix:'.format())
matrix = atoms1.connectivity
table_matrix = np.array(matrix, dtype=str)

print('#+attr_latex: :mode math :environment matrix')
for row in table_matrix:
    print('|' + '|'.join(row.astype(str)))

print('\nAre isomorphs: {}'.format(atoms0.is_isomorph(atoms1)))
#+END_SRC

#+RESULTS:
:RESULTS:
<class 'catkit.gratoms.Gratoms'>

Atomic numbers
#+attr_latex: :mode math :environment matrix
| 6 | 6 | 6 | 6 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |

Connectivity matrix:
#+attr_latex: :mode math :environment matrix
| 0 | 1 | 1 | 1 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 1 | 0 | 0 | 0 | 0 | 1 | 1 | 1 | 0 | 0 | 0 | 0 | 0 | 0 |
| 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 1 | 1 | 1 | 0 | 0 | 0 |
| 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 1 | 1 | 1 |
| 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 0 | 0 | 0 | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |

Atomic numbers
#+attr_latex: :mode math :environment matrix
|6|6|6|1|1|1|1|1|1|1|1|1|1

Connectivity matrix:
#+attr_latex: :mode math :environment matrix
|0|0|0|0|1|1|1|0|0|0|0|0|0
|0|0|0|0|0|0|0|1|1|1|0|0|0
|0|0|0|0|0|0|0|0|0|0|1|1|1
|0|0|0|0|0|0|0|0|0|0|0|0|0
|1|0|0|0|0|0|0|0|0|0|0|0|0
|1|0|0|0|0|0|0|0|0|0|0|0|0
|1|0|0|0|0|0|0|0|0|0|0|0|0
|0|1|0|0|0|0|0|0|0|0|0|0|0
|0|1|0|0|0|0|0|0|0|0|0|0|0
|0|1|0|0|0|0|0|0|0|0|0|0|0
|0|0|1|0|0|0|0|0|0|0|0|0|0
|0|0|1|0|0|0|0|0|0|0|0|0|0
|0|0|1|0|0|0|0|0|0|0|0|0|0

Are isomorphs: False
:END:

