docs/build/html/_static/frontmatter/catkit.org
* PawPrint
The fingerprint generator is designed to be a general purpose utility for returning manipulated parameters from a list of possible operations. The possible operations which are currently implemented cat be found in [[./pawprint/operations.py]].

The complete list of seeding parameters which can be called from is available from the data dictionary produced from Mendeleev.

#+BEGIN_SRC python :results output org drawer :exports both
import json

with open('../../catkit/data/properties.json', 'r') as f:
    data = json.load(f)

print('|Keys| First 10 values')
print('|-')
for k, v in data.items():
    print('|{}|{}'.format(k, ', '.join([str(round(_, 3)) for _ in v[1:11]])))
#+END_SRC

#+RESULTS:
:RESULTS:
| Keys                          | First 10 values                                                         |
|-------------------------------+-------------------------------------------------------------------------|
| atomic_number                 | 1, 2, 3, 4, 5, 6, 7, 8, 9, 10                                           |
| atomic_radius                 | 0.79, nan, 1.55, 1.12, 0.98, 0.91, 0.92, nan, nan, nan                  |
| atomic_radius_rahm            | 1.54, 1.34, 2.2, 2.19, 2.05, 1.9, 1.79, 1.71, 1.63, 1.56                |
| atomic_volume                 | 14.1, 31.8, 13.1, 5.0, 4.6, 5.3, 17.3, 14.0, 17.1, 16.8                 |
| atomic_weight                 | 1.008, 4.003, 6.94, 9.012, 10.81, 12.011, 14.007, 15.999, 18.998, 20.18 |
| boiling_point                 | 20.28, 4.216, 1118.15, 3243.0, 3931.0, 5100.0, 77.4, 90.19, 85.01, 27.1 |
| c6                            | 6.499, 1.42, 1392.0, 227.0, 99.5, 46.6, 24.2, 15.6, 9.52, 6.2           |
| c6_gb                         | 6.51, 1.47, 1410.0, 214.0, 99.2, 47.9, 25.7, 16.7, 10.2, 6.91           |
| covalent_radius_bragg         | nan, nan, 1.5, 1.15, nan, 0.77, 0.65, 0.65, 0.67, nan                   |
| covalent_radius_cordero       | 0.31, 0.28, 1.28, 0.96, 0.84, 0.73, 0.71, 0.66, 0.57, 0.58              |
| covalent_radius_pyykko        | 0.32, 0.46, 1.33, 1.02, 0.85, 0.75, 0.71, 0.63, 0.64, 0.67              |
| covalent_radius_pyykko_double | nan, nan, 1.24, 0.9, 0.78, 0.67, 0.6, 0.57, 0.59, 0.96                  |
| covalent_radius_pyykko_triple | nan, nan, nan, 0.85, 0.73, 0.6, 0.54, 0.53, 0.53, nan                   |
| covalent_radius_slater        | 0.25, nan, 1.45, 1.05, 0.85, 0.7, 0.65, 0.6, 0.5, nan                   |
| dband_center_bulk             | nan, nan, nan, nan, nan, nan, nan, nan, nan, nan                        |
| dband_center_slab             | 1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan                        |
| dband_kurtosis_bulk           | nan, nan, nan, nan, nan, nan, nan, nan, nan, nan                        |
| dband_kurtosis_slab           | 1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan                        |
| dband_skewness_bulk           | nan, nan, nan, nan, nan, nan, nan, nan, nan, nan                        |
| dband_skewness_slab           | 1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan                        |
| dband_width_bulk              | nan, nan, nan, nan, nan, nan, nan, nan, nan, nan                        |
| dband_width_slab              | 1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan                        |
| density                       | 0.071, 0.147, 0.534, 1.848, 2.34, 2.25, 0.808, 1.149, 1.108, 1.204      |
| dipole_polarizability         | 4.507, 1.384, 164.0, 37.71, 20.53, 20.53, 7.6, 5.24, 3.7, 2.67          |
| electron_affinity             | 0.754, -19.7, 0.618, -2.4, 0.28, 1.262, -1.4, 1.461, 3.401, nan         |
| en_allen                      | 13.61, 24.59, 5.392, 9.323, 12.13, 15.05, 18.13, 21.36, 24.8, 28.31     |
| en_ghosh                      | 0.264, 0.443, 0.105, 0.145, 0.185, 0.225, 0.265, 0.305, 0.344, 0.384    |
| en_pauling                    | 2.2, nan, 0.98, 1.57, 2.04, 2.55, 3.04, 3.44, 3.98, nan                 |
| evaporation_heat              | 0.904, 0.08, 148.0, 309.0, 504.5, nan, nan, nan, 6.54, 1.74             |
| fusion_heat                   | 0.117, nan, 2.89, 12.21, 23.6, nan, nan, nan, 0.51, nan                 |
| gas_basicity                  | nan, 148.5, nan, nan, nan, nan, 318.7, 459.6, 315.1, 174.4              |
| group_id                      | 1, 18, 1, 2, 13, 14, 15, 16, 17, 18                                     |
| heat_of_formation             | 217.998, nan, 159.3, 324.0, 565.0, 716.87, 472.44, 249.229, 79.335, nan |
| lattice_constant              | 3.75, 3.57, 3.49, 2.29, 8.73, 3.57, 4.039, 6.83, nan, 4.43              |
| melting_point                 | 14.01, 0.95, 553.69, 1551.0, 2573.0, 3820.0, 63.29, 54.8, 53.53, 48.0   |
| metallic_radius               | nan, nan, 1.23, 0.89, 0.8, nan, nan, nan, nan, nan                      |
| metallic_radius_c12           | 0.78, 1.22, 1.55, 1.12, 0.98, 0.86, 0.53, nan, nan, nan                 |
| period                        | 1, 1, 2, 2, 2, 2, 2, 2, 2, 2                                            |
| proton_affinity               | nan, 177.8, nan, nan, nan, nan, 342.2, 485.2, 340.1, 198.8              |
| specific_heat                 | nan, 5.188, 3.489, 1.824, 1.025, 0.711, nan, nan, nan, 1.029            |
| thermal_conductivity          | 0.181, 0.152, 84.8, 201.0, 27.4, 1.59, 0.026, 0.027, 0.028, nan         |
| vdw_radius                    | 1.1, 1.4, 1.82, 1.53, 1.92, 1.7, 1.55, 1.52, 1.47, 1.54                 |
| vdw_radius_alvarez            | 1.2, 1.43, 2.12, 1.98, 1.91, 1.77, 1.66, 1.5, 1.46, 1.58                |
| vdw_radius_batsanov           | nan, nan, 2.2, 1.9, 1.8, 1.7, 1.6, 1.55, 1.5, nan                       |
| vdw_radius_bondi              | 1.2, 1.4, 1.81, nan, nan, 1.7, 1.55, 1.52, 1.47, 1.54                   |
| vdw_radius_dreiding           | 3.195, nan, nan, nan, 4.02, 3.898, 3.662, 3.405, 3.472, nan             |
| vdw_radius_mm3                | 1.62, 1.53, 2.55, 2.23, 2.15, 2.04, 1.93, 1.82, 1.71, 1.6               |
| vdw_radius_rt                 | 1.1, nan, nan, nan, nan, 1.77, 1.64, 1.58, 1.46, 1.81                   |
| vdw_radius_truhlar            | nan, nan, nan, 1.53, 1.92, nan, nan, nan, nan, nan                      |
| vdw_radius_uff                | 2.886, 2.362, 2.451, 2.745, 4.083, 3.851, 3.66, 3.5, 3.364, 3.243       |
:END:

A list of atoms objects can also be passed to any of the generators.This will increase the dimensionality of the numpy array returned by 1 for each atoms object in the supplied list of images. Fingerprints produced in this way are returned in the same order as the list of objects provided.

