docs/build/html/frontmatter/catkit.html

<div id="outline-container-org05ed632" class="outline-2">
<h2 id="org05ed632"><span class="section-number-2">2</span> PawPrint</h2>
<div class="outline-text-2" id="text-2">
<p>
The fingerprint generator is designed to be a general purpose utility for returning manipulated parameters from a list of possible operations. The possible operations which are currently implemented cat be found in <a href="./pawprint/operations.py">./pawprint/operations.py</a>.
</p>

<p>
The complete list of seeding parameters which can be called from is available from the data dictionary produced from Mendeleev.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> json

<span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(<span style="color: #008000;">'../../catkit/data/properties.json'</span>, <span style="color: #008000;">'r'</span>) <span style="color: #0000FF;">as</span> f:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">data</span> = json.load(f)

<span style="color: #0000FF;">print</span>(<span style="color: #008000;">'|Keys| First 10 values'</span>)
<span style="color: #0000FF;">print</span>(<span style="color: #008000;">'|-'</span>)
<span style="color: #0000FF;">for</span> k, v <span style="color: #0000FF;">in</span> data.items():
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'|{}|{}'</span>.<span style="color: #006FE0;">format</span>(k, <span style="color: #008000;">', '</span>.join([<span style="color: #006FE0;">str</span>(<span style="color: #006FE0;">round</span>(_, 3)) <span style="color: #0000FF;">for</span> _ <span style="color: #0000FF;">in</span> v[1:11]])))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keys</th>
<th scope="col" class="org-left">First 10 values</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">atomic_number</td>
<td class="org-left">1, 2, 3, 4, 5, 6, 7, 8, 9, 10</td>
</tr>

<tr>
<td class="org-left">atomic_radius</td>
<td class="org-left">0.79, nan, 1.55, 1.12, 0.98, 0.91, 0.92, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">atomic_radius_rahm</td>
<td class="org-left">1.54, 1.34, 2.2, 2.19, 2.05, 1.9, 1.79, 1.71, 1.63, 1.56</td>
</tr>

<tr>
<td class="org-left">atomic_volume</td>
<td class="org-left">14.1, 31.8, 13.1, 5.0, 4.6, 5.3, 17.3, 14.0, 17.1, 16.8</td>
</tr>

<tr>
<td class="org-left">atomic_weight</td>
<td class="org-left">1.008, 4.003, 6.94, 9.012, 10.81, 12.011, 14.007, 15.999, 18.998, 20.18</td>
</tr>

<tr>
<td class="org-left">boiling_point</td>
<td class="org-left">20.28, 4.216, 1118.15, 3243.0, 3931.0, 5100.0, 77.4, 90.19, 85.01, 27.1</td>
</tr>

<tr>
<td class="org-left">c6</td>
<td class="org-left">6.499, 1.42, 1392.0, 227.0, 99.5, 46.6, 24.2, 15.6, 9.52, 6.2</td>
</tr>

<tr>
<td class="org-left">c6_gb</td>
<td class="org-left">6.51, 1.47, 1410.0, 214.0, 99.2, 47.9, 25.7, 16.7, 10.2, 6.91</td>
</tr>

<tr>
<td class="org-left">covalent_radius_bragg</td>
<td class="org-left">nan, nan, 1.5, 1.15, nan, 0.77, 0.65, 0.65, 0.67, nan</td>
</tr>

<tr>
<td class="org-left">covalent_radius_cordero</td>
<td class="org-left">0.31, 0.28, 1.28, 0.96, 0.84, 0.73, 0.71, 0.66, 0.57, 0.58</td>
</tr>

<tr>
<td class="org-left">covalent_radius_pyykko</td>
<td class="org-left">0.32, 0.46, 1.33, 1.02, 0.85, 0.75, 0.71, 0.63, 0.64, 0.67</td>
</tr>

<tr>
<td class="org-left">covalent_radius_pyykko_double</td>
<td class="org-left">nan, nan, 1.24, 0.9, 0.78, 0.67, 0.6, 0.57, 0.59, 0.96</td>
</tr>

<tr>
<td class="org-left">covalent_radius_pyykko_triple</td>
<td class="org-left">nan, nan, nan, 0.85, 0.73, 0.6, 0.54, 0.53, 0.53, nan</td>
</tr>

<tr>
<td class="org-left">covalent_radius_slater</td>
<td class="org-left">0.25, nan, 1.45, 1.05, 0.85, 0.7, 0.65, 0.6, 0.5, nan</td>
</tr>

<tr>
<td class="org-left">dband_center_bulk</td>
<td class="org-left">nan, nan, nan, nan, nan, nan, nan, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">dband_center_slab</td>
<td class="org-left">1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan</td>
</tr>

<tr>
<td class="org-left">dband_kurtosis_bulk</td>
<td class="org-left">nan, nan, nan, nan, nan, nan, nan, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">dband_kurtosis_slab</td>
<td class="org-left">1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan</td>
</tr>

<tr>
<td class="org-left">dband_skewness_bulk</td>
<td class="org-left">nan, nan, nan, nan, nan, nan, nan, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">dband_skewness_slab</td>
<td class="org-left">1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan</td>
</tr>

<tr>
<td class="org-left">dband_width_bulk</td>
<td class="org-left">nan, nan, nan, nan, nan, nan, nan, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">dband_width_slab</td>
<td class="org-left">1.0, nan, nan, nan, nan, 1.0, 1.0, 1.0, 1.0, nan</td>
</tr>

<tr>
<td class="org-left">density</td>
<td class="org-left">0.071, 0.147, 0.534, 1.848, 2.34, 2.25, 0.808, 1.149, 1.108, 1.204</td>
</tr>

<tr>
<td class="org-left">dipole_polarizability</td>
<td class="org-left">4.507, 1.384, 164.0, 37.71, 20.53, 20.53, 7.6, 5.24, 3.7, 2.67</td>
</tr>

<tr>
<td class="org-left">electron_affinity</td>
<td class="org-left">0.754, -19.7, 0.618, -2.4, 0.28, 1.262, -1.4, 1.461, 3.401, nan</td>
</tr>

<tr>
<td class="org-left">en_allen</td>
<td class="org-left">13.61, 24.59, 5.392, 9.323, 12.13, 15.05, 18.13, 21.36, 24.8, 28.31</td>
</tr>

<tr>
<td class="org-left">en_ghosh</td>
<td class="org-left">0.264, 0.443, 0.105, 0.145, 0.185, 0.225, 0.265, 0.305, 0.344, 0.384</td>
</tr>

<tr>
<td class="org-left">en_pauling</td>
<td class="org-left">2.2, nan, 0.98, 1.57, 2.04, 2.55, 3.04, 3.44, 3.98, nan</td>
</tr>

<tr>
<td class="org-left">evaporation_heat</td>
<td class="org-left">0.904, 0.08, 148.0, 309.0, 504.5, nan, nan, nan, 6.54, 1.74</td>
</tr>

<tr>
<td class="org-left">fusion_heat</td>
<td class="org-left">0.117, nan, 2.89, 12.21, 23.6, nan, nan, nan, 0.51, nan</td>
</tr>

<tr>
<td class="org-left">gas_basicity</td>
<td class="org-left">nan, 148.5, nan, nan, nan, nan, 318.7, 459.6, 315.1, 174.4</td>
</tr>

<tr>
<td class="org-left">group_id</td>
<td class="org-left">1, 18, 1, 2, 13, 14, 15, 16, 17, 18</td>
</tr>

<tr>
<td class="org-left">heat_of_formation</td>
<td class="org-left">217.998, nan, 159.3, 324.0, 565.0, 716.87, 472.44, 249.229, 79.335, nan</td>
</tr>

<tr>
<td class="org-left">lattice_constant</td>
<td class="org-left">3.75, 3.57, 3.49, 2.29, 8.73, 3.57, 4.039, 6.83, nan, 4.43</td>
</tr>

<tr>
<td class="org-left">melting_point</td>
<td class="org-left">14.01, 0.95, 553.69, 1551.0, 2573.0, 3820.0, 63.29, 54.8, 53.53, 48.0</td>
</tr>

<tr>
<td class="org-left">metallic_radius</td>
<td class="org-left">nan, nan, 1.23, 0.89, 0.8, nan, nan, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">metallic_radius_c12</td>
<td class="org-left">0.78, 1.22, 1.55, 1.12, 0.98, 0.86, 0.53, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">period</td>
<td class="org-left">1, 1, 2, 2, 2, 2, 2, 2, 2, 2</td>
</tr>

<tr>
<td class="org-left">proton_affinity</td>
<td class="org-left">nan, 177.8, nan, nan, nan, nan, 342.2, 485.2, 340.1, 198.8</td>
</tr>

<tr>
<td class="org-left">specific_heat</td>
<td class="org-left">nan, 5.188, 3.489, 1.824, 1.025, 0.711, nan, nan, nan, 1.029</td>
</tr>

<tr>
<td class="org-left">thermal_conductivity</td>
<td class="org-left">0.181, 0.152, 84.8, 201.0, 27.4, 1.59, 0.026, 0.027, 0.028, nan</td>
</tr>

<tr>
<td class="org-left">vdw_radius</td>
<td class="org-left">1.1, 1.4, 1.82, 1.53, 1.92, 1.7, 1.55, 1.52, 1.47, 1.54</td>
</tr>

<tr>
<td class="org-left">vdw_radius_alvarez</td>
<td class="org-left">1.2, 1.43, 2.12, 1.98, 1.91, 1.77, 1.66, 1.5, 1.46, 1.58</td>
</tr>

<tr>
<td class="org-left">vdw_radius_batsanov</td>
<td class="org-left">nan, nan, 2.2, 1.9, 1.8, 1.7, 1.6, 1.55, 1.5, nan</td>
</tr>

<tr>
<td class="org-left">vdw_radius_bondi</td>
<td class="org-left">1.2, 1.4, 1.81, nan, nan, 1.7, 1.55, 1.52, 1.47, 1.54</td>
</tr>

<tr>
<td class="org-left">vdw_radius_dreiding</td>
<td class="org-left">3.195, nan, nan, nan, 4.02, 3.898, 3.662, 3.405, 3.472, nan</td>
</tr>

<tr>
<td class="org-left">vdw_radius_mm3</td>
<td class="org-left">1.62, 1.53, 2.55, 2.23, 2.15, 2.04, 1.93, 1.82, 1.71, 1.6</td>
</tr>

<tr>
<td class="org-left">vdw_radius_rt</td>
<td class="org-left">1.1, nan, nan, nan, nan, 1.77, 1.64, 1.58, 1.46, 1.81</td>
</tr>

<tr>
<td class="org-left">vdw_radius_truhlar</td>
<td class="org-left">nan, nan, nan, 1.53, 1.92, nan, nan, nan, nan, nan</td>
</tr>

<tr>
<td class="org-left">vdw_radius_uff</td>
<td class="org-left">2.886, 2.362, 2.451, 2.745, 4.083, 3.851, 3.66, 3.5, 3.364, 3.243</td>
</tr>
</tbody>
</table>

<p>
A list of atoms objects can also be passed to any of the generators.This will increase the dimensionality of the numpy array returned by 1 for each atoms object in the supplied list of images. Fingerprints produced in this way are returned in the same order as the list of objects provided.
</p>
</div>
