docs/build/html/_static/frontmatter/catkit.org
** Non-local fingerprint generation
Currently, the fingerprint generator has operations for producing convolutions over all atoms in a provided list of atoms objects. There is only a single type of convolution which performs this type of operation currently:

1. =periodic_convolution=
    Calculates the square of each atoms parameter in the unit cell.
2. =bonding_convolution=
    Calculates a convolution over indexed bonded atoms.

These functions can take additional keyword arguments as well, these are provided in the form of a dictionary as demonstrated in the following example.

#+BEGIN_SRC python :results output org drawer :exports both
from catkit.pawprint import Fingerprinter
from ase.build import fcc111
from ase.build import bulk
import numpy as np
from catkit.gen import defaults
defaults['covalent_radii'] += 0.15

bulk = bulk('Pd', cubic=True)
bulk[3].symbol = 'Pt'

slab = fcc111('Al', size=(2, 2, 3), a=3.8, vacuum=10.0)

images = [bulk, slab]

parameters = [
    'atomic_number',
    'atomic_radius',
    'atomic_volume',
]

operations = [
    'periodic_convolution',
    ['periodic_convolution', {'d': 1}]
]

fp = Fingerprinter(images)
fingerprints = fp.get_fp(parameters, operations)

print('#+attr_latex: :mode math :environment matrix')
for fp in fingerprints:
    fp_table = np.round(fp, 3)
    print('|' + '|'.join(fp_table.astype(str)))
#+END_SRC

#+RESULTS:
:RESULTS:
#+attr_latex: :mode math :environment matrix
| 12432.0 |  7.563 | 320.44 | 136896.0 |  90.749 |  3844.8 |
|  2028.0 | 24.539 | 1200.0 |  20280.0 | 245.388 | 12000.0 |
:END:

** Local fingerprint generation
Localized fingerprints can also be generated. This is demonstrated for a catalytic structure of Palladium with a single Carbon adsorbate.

#+BEGIN_SRC python :results output org drawer :exports both
from catkit.pawprint import Fingerprinter
from ase.build import fcc111
from ase.build import add_adsorbate
import numpy as np

atoms = fcc111('Pd', size=(2, 2, 3), vacuum=10.0)
add_adsorbate(atoms, 'C', 1, 'fcc')

# -1 is the tag convention to identify bonded atoms
tags = atoms.get_tags()
tags[-1] = -1
atoms.set_tags(tags)

parameters = [
    'atomic_number',
    'atomic_radius',
    'boiling_point',
    'covalent_radius_cordero',
    'evaporation_heat',
    'fusion_heat',
    'group_id',
    'period',
]

operations = [
    'bonding_convolution'
]

fp = Fingerprinter(atoms)
fingerprints = fp.get_fp(parameters, operations)

print('#+attr_latex: :mode math :environment matrix')
fp_table = np.round(fingerprints[0], 3)
print('|' + '|'.join(fp_table.astype(str)))
#+END_SRC

#+RESULTS:
:RESULTS:
#+attr_latex: :mode math :environment matrix
| 276.0 | 1.247 | 17406300.0 | 1.015 | nan | nan | 140.0 | 10.0 |
:END:

The generators purpose is not to restrict which fingerprints can be generated, however, if no seed parameter is available for a particular chemical species, then an =Numpy= NaN value will be returned.

