docs/build/html/frontmatter/catkit.html

<div id="outline-container-org81ae3b7" class="outline-3">
<h3 id="org81ae3b7"><span class="section-number-3">2.1</span> Non-local fingerprint generation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Currently, the fingerprint generator has operations for producing convolutions over all atoms in a provided list of atoms objects. There is only a single type of convolution which performs this type of operation currently:
</p>

<ol class="org-ol">
<li><code>periodic_convolution</code>
Calculates the square of each atoms parameter in the unit cell.</li>
<li><code>bonding_convolution</code>
Calculates a convolution over indexed bonded atoms.</li>
</ol>

<p>
These functions can take additional keyword arguments as well, these are provided in the form of a dictionary as demonstrated in the following example.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> catkit.pawprint <span style="color: #0000FF;">import</span> Fingerprinter
<span style="color: #0000FF;">from</span> ase.build <span style="color: #0000FF;">import</span> fcc111
<span style="color: #0000FF;">from</span> ase.build <span style="color: #0000FF;">import</span> bulk
<span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np
<span style="color: #0000FF;">from</span> catkit.gen <span style="color: #0000FF;">import</span> defaults
<span style="color: #BA36A5;">defaults</span>[<span style="color: #008000;">'covalent_radii'</span>] += 0.15

<span style="color: #BA36A5;">bulk</span> = bulk(<span style="color: #008000;">'Pd'</span>, cubic=<span style="color: #D0372D;">True</span>)
bulk[3]<span style="color: #BA36A5;">.symbol</span> = <span style="color: #008000;">'Pt'</span>

<span style="color: #BA36A5;">slab</span> = fcc111(<span style="color: #008000;">'Al'</span>, size=(2, 2, 3), a=3.8, vacuum=10.0)

<span style="color: #BA36A5;">images</span> = [bulk, slab]

<span style="color: #BA36A5;">parameters</span> = [
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'atomic_number'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'atomic_radius'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'atomic_volume'</span>,
]

<span style="color: #BA36A5;">operations</span> = [
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'periodic_convolution'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   [<span style="color: #008000;">'periodic_convolution'</span>, {<span style="color: #008000;">'d'</span>: 1}]
]

<span style="color: #BA36A5;">fp</span> = Fingerprinter(images)
<span style="color: #BA36A5;">fingerprints</span> = fp.get_fp(parameters, operations)

<span style="color: #0000FF;">print</span>(<span style="color: #008000;">'#+attr_latex: :mode math :environment matrix'</span>)
<span style="color: #0000FF;">for</span> fp <span style="color: #0000FF;">in</span> fingerprints:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">fp_table</span> = np.<span style="color: #006FE0;">round</span>(fp, 3)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'|'</span> + <span style="color: #008000;">'|'</span>.join(fp_table.astype(<span style="color: #006FE0;">str</span>)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">12432.0</td>
<td class="org-right">7.563</td>
<td class="org-right">320.44</td>
<td class="org-right">136896.0</td>
<td class="org-right">90.749</td>
<td class="org-right">3844.8</td>
</tr>

<tr>
<td class="org-right">2028.0</td>
<td class="org-right">24.539</td>
<td class="org-right">1200.0</td>
<td class="org-right">20280.0</td>
<td class="org-right">245.388</td>
<td class="org-right">12000.0</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org75bed77" class="outline-3">
<h3 id="org75bed77"><span class="section-number-3">2.2</span> Local fingerprint generation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Localized fingerprints can also be generated. This is demonstrated for a catalytic structure of Palladium with a single Carbon adsorbate.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> catkit.pawprint <span style="color: #0000FF;">import</span> Fingerprinter
<span style="color: #0000FF;">from</span> ase.build <span style="color: #0000FF;">import</span> fcc111
<span style="color: #0000FF;">from</span> ase.build <span style="color: #0000FF;">import</span> add_adsorbate
<span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np

<span style="color: #BA36A5;">atoms</span> = fcc111(<span style="color: #008000;">'Pd'</span>, size=(2, 2, 3), vacuum=10.0)
add_adsorbate(atoms, <span style="color: #008000;">'C'</span>, 1, <span style="color: #008000;">'fcc'</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">-1 is the tag convention to identify bonded atoms</span>
<span style="color: #BA36A5;">tags</span> = atoms.get_tags()
<span style="color: #BA36A5;">tags</span>[-1] = -1
atoms.set_tags(tags)

<span style="color: #BA36A5;">parameters</span> = [
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'atomic_number'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'atomic_radius'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'boiling_point'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'covalent_radius_cordero'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'evaporation_heat'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'fusion_heat'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'group_id'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'period'</span>,
]

<span style="color: #BA36A5;">operations</span> = [
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">'bonding_convolution'</span>
]

<span style="color: #BA36A5;">fp</span> = Fingerprinter(atoms)
<span style="color: #BA36A5;">fingerprints</span> = fp.get_fp(parameters, operations)

<span style="color: #0000FF;">print</span>(<span style="color: #008000;">'#+attr_latex: :mode math :environment matrix'</span>)
<span style="color: #BA36A5;">fp_table</span> = np.<span style="color: #006FE0;">round</span>(fingerprints[0], 3)
<span style="color: #0000FF;">print</span>(<span style="color: #008000;">'|'</span> + <span style="color: #008000;">'|'</span>.join(fp_table.astype(<span style="color: #006FE0;">str</span>)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">276.0</td>
<td class="org-right">1.247</td>
<td class="org-right">17406300.0</td>
<td class="org-right">1.015</td>
<td class="org-right">nan</td>
<td class="org-right">nan</td>
<td class="org-right">140.0</td>
<td class="org-right">10.0</td>
</tr>
</tbody>
</table>

<p>
The generators purpose is not to restrict which fingerprints can be generated, however, if no seed parameter is available for a particular chemical species, then an <code>Numpy</code> NaN value will be returned.
</p>
</div>
</div>
