docs/build/html/_static/frontmatter/catkit.org
** Writing personalized operations
Currently, the default structure of and operation is as follows:

#+BEGIN_EXAMPLE :exports both
def periodic_convolution(
        atoms,
        atoms_parameters,
        connectivity):
#+END_EXAMPLE

Where the =atoms=, =atoms_properties=, and =connectivity= properties are required. This is because these properties are passed to all operation functions currently implemented so that they do not need to be generated multiple times. This way change in future versions if it seems that these are better suited as global variables (This may makes the code overly difficult to follow).

Here is an example of a simple operation which supplies the adsorbate connectivity.

#+BEGIN_SRC python :results output org drawer :exports both
from catkit.pawprint import Fingerprinter
from ase.build import fcc111
from ase.build import add_adsorbate
import numpy as np

atoms = fcc111('Pd', size=(2, 2, 3), vacuum=10.0)
add_adsorbate(atoms, 'C', 1, 'fcc')

# -1 is the tag convention to identify bonded atoms
tags = atoms.get_tags()
tags[-1] = -1
atoms.set_tags(tags)

parameters = [
    'atomic_number',
    'dband_center_slab',
    'dband_width_slab',
    'dband_skewness_slab',
    'dband_kurtosis_slab'
]

def example_operation(
        atoms,
        atoms_parameters,
        connectivity):
    # This is a CatKit convention
    bond_index = np.where(atoms.get_tags() == -1)[0]

    return np.sum(connectivity[bond_index], axis=1)

operations = [
    'bonding_convolution',
    example_operation
]

fp = Fingerprinter(atoms)
fingerprints = fp.get_fp(parameters, operations)
fp_table = np.round(fingerprints[0], 3)

print('#+attr_latex: :mode math :environment matrix')
print('|' + '|'.join(fp_table.astype(str)))
#+END_SRC

#+RESULTS:
:RESULTS:
#+attr_latex: :mode math :environment matrix
| 276.0 | -1.57 | 6.517 | -81.368 | 3651.487 | 3.0 |
:END:

